garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q71.PIC
        <edc:SFRDef edc:access="-----nnn" edc:cname="DMA4PR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="DMA4PR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xB9">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DMA4PR" edc:mask="0x7" edc:name="DMA4PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="DMA4PR0" edc:mask="0x1" edc:name="DMA4PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR1" edc:mask="0x1" edc:name="DMA4PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4PR2" edc:mask="0x1" edc:name="DMA4PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0xBA"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="MAINPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="MAINPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MAINPR" edc:mask="0x7" edc:name="MAINPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MAINPR0" edc:mask="0x1" edc:name="MAINPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR1" edc:mask="0x1" edc:name="MAINPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MAINPR2" edc:mask="0x1" edc:name="MAINPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="ISRPR" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----111" edc:name="ISRPR" edc:nzwidth="8" edc:por="-----111" edc:_addr="0xBF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR" edc:mask="0x7" edc:name="PR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PR0" edc:mask="0x1" edc:name="PR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR1" edc:mask="0x1" edc:name="PR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PR2" edc:mask="0x1" edc:name="PR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ISRPR" edc:mask="0x7" edc:name="ISRPR" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ISRPR0" edc:mask="0x1" edc:name="ISRPR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR1" edc:mask="0x1" edc:name="ISRPR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ISRPR2" edc:mask="0x1" edc:name="ISRPR2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DAC2DAT" edc:desc="" edc:name="DAC2DAT" edc:nzwidth="0x10" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xC0">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC2DATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC2DATL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0xC0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAC2R" edc:mask="0xff" edc:name="DAC2R" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC2R0" edc:mask="0x1" edc:name="DAC2R0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R1" edc:mask="0x1" edc:name="DAC2R1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R2" edc:mask="0x1" edc:name="DAC2R2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R3" edc:mask="0x1" edc:name="DAC2R3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R4" edc:mask="0x1" edc:name="DAC2R4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R5" edc:mask="0x1" edc:name="DAC2R5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R6" edc:mask="0x1" edc:name="DAC2R6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC2R7" edc:mask="0x1" edc:name="DAC2R7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DAC2RL" edc:mask="0xff" edc:name="DAC2RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:AdjustPoint edc:offset="1" edc:_addr="0xC1"/>
        </edc:JoinedSFRDef>
