garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PORTWDF" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PORTWDF" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x10B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DF0" edc:desc="" edc:mask="0x1" edc:name="DF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF1" edc:desc="" edc:mask="0x1" edc:name="DF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DF2" edc:desc="" edc:mask="0x1" edc:name="DF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF3" edc:desc="" edc:mask="0x1" edc:name="DF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF4" edc:desc="" edc:mask="0x1" edc:name="DF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF5" edc:desc="" edc:mask="0x1" edc:name="DF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF6" edc:desc="" edc:mask="0x1" edc:name="DF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DF7" edc:desc="" edc:mask="0x1" edc:name="DF7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWDF0" edc:desc="" edc:mask="0x1" edc:name="PWDF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF1" edc:desc="" edc:mask="0x1" edc:name="PWDF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF2" edc:mask="0x1" edc:name="PWDF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF3" edc:desc="" edc:mask="0x1" edc:name="PWDF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWDF4" edc:mask="0x1" edc:name="PWDF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF5" edc:mask="0x1" edc:name="PWDF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF6" edc:mask="0x1" edc:name="PWDF6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWDF7" edc:mask="0x1" edc:name="PWDF7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="DF" edc:mask="0xff" edc:name="DF" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="PWDF" edc:mask="0xff" edc:name="PWDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------n" edc:cname="PORTWCON" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0" edc:name="PORTWCON" edc:nzwidth="8" edc:por="-------0" edc:_modsrc="DOS-05249_io_vport_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x10C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKEN" edc:desc="" edc:mask="0x1" edc:name="CLKEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x10D"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGA" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x110">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGA0" edc:mask="0x1" edc:name="CGA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA1" edc:mask="0x1" edc:name="CGA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA2" edc:mask="0x1" edc:name="CGA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA3" edc:mask="0x1" edc:name="CGA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA4" edc:mask="0x1" edc:name="CGA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA5" edc:mask="0x1" edc:name="CGA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA6" edc:mask="0x1" edc:name="CGA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGA7" edc:mask="0x1" edc:name="CGA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGA0" edc:mask="0x1" edc:name="ADCGA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA1" edc:mask="0x1" edc:name="ADCGA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA2" edc:mask="0x1" edc:name="ADCGA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA3" edc:mask="0x1" edc:name="ADCGA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA4" edc:mask="0x1" edc:name="ADCGA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA5" edc:mask="0x1" edc:name="ADCGA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA6" edc:mask="0x1" edc:name="ADCGA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGA7" edc:mask="0x1" edc:name="ADCGA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGB" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x111">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGB0" edc:mask="0x1" edc:name="CGB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB1" edc:mask="0x1" edc:name="CGB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB2" edc:mask="0x1" edc:name="CGB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB3" edc:mask="0x1" edc:name="CGB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB4" edc:mask="0x1" edc:name="CGB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB5" edc:mask="0x1" edc:name="CGB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB6" edc:mask="0x1" edc:name="CGB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGB7" edc:mask="0x1" edc:name="CGB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGB0" edc:mask="0x1" edc:name="ADCGB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB1" edc:mask="0x1" edc:name="ADCGB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB2" edc:mask="0x1" edc:name="ADCGB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB3" edc:mask="0x1" edc:name="ADCGB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB4" edc:mask="0x1" edc:name="ADCGB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB5" edc:mask="0x1" edc:name="ADCGB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB6" edc:mask="0x1" edc:name="ADCGB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGB7" edc:mask="0x1" edc:name="ADCGB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ADCGC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="ADCGC" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x112">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CGC0" edc:mask="0x1" edc:name="CGC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC1" edc:mask="0x1" edc:name="CGC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC2" edc:mask="0x1" edc:name="CGC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC3" edc:mask="0x1" edc:name="CGC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC4" edc:mask="0x1" edc:name="CGC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC5" edc:mask="0x1" edc:name="CGC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC6" edc:mask="0x1" edc:name="CGC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CGC7" edc:mask="0x1" edc:name="CGC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCGC0" edc:mask="0x1" edc:name="ADCGC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC1" edc:mask="0x1" edc:name="ADCGC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC2" edc:mask="0x1" edc:name="ADCGC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC3" edc:mask="0x1" edc:name="ADCGC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC4" edc:mask="0x1" edc:name="ADCGC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC5" edc:mask="0x1" edc:name="ADCGC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC6" edc:mask="0x1" edc:name="ADCGC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCGC7" edc:mask="0x1" edc:name="ADCGC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0xC" edc:_addr="0x113"/>
        <edc:SFRDef edc:access="n-n-n---" edc:cname="OPA1CON0" edc:desc="" edc:impl="0xa8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0---" edc:name="OPA1CON0" edc:nzwidth="8" edc:por="0-0-0---" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x11F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="UG" edc:mask="0x1" edc:name="UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CPON" edc:mask="0x1" edc:name="CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="UG0" edc:mask="0x1" edc:name="UG0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPA1UG" edc:mask="0x1" edc:name="OPA1UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1CPON" edc:mask="0x1" edc:name="OPA1CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1EN" edc:desc="" edc:mask="0x1" edc:name="OPA1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OPA1CON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OPA1CON1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x120">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:mask="0x7" edc:name="NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="RESON" edc:mask="0x1" edc:name="RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL" edc:mask="0x7" edc:name="GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS2" edc:mask="0x1" edc:name="NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL0" edc:mask="0x1" edc:name="GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL1" edc:mask="0x1" edc:name="GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL2" edc:mask="0x1" edc:name="GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1NSS" edc:mask="0x7" edc:name="OPA1NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1RESON" edc:mask="0x1" edc:name="OPA1RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL" edc:mask="0x7" edc:name="OPA1GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1NSS0" edc:mask="0x1" edc:name="OPA1NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NSS1" edc:mask="0x1" edc:name="OPA1NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NSS2" edc:mask="0x1" edc:name="OPA1NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL0" edc:mask="0x1" edc:name="OPA1GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL1" edc:mask="0x1" edc:name="OPA1GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1GSEL2" edc:mask="0x1" edc:name="OPA1GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="OPA1CON2" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="OPA1CON2" edc:nzwidth="8" edc:por="-000-000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x121">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:mask="0x7" edc:name="PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCH" edc:mask="0x7" edc:name="NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCH0" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH0" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PCH" edc:mask="0x7" edc:name="OPA1PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH" edc:mask="0x7" edc:name="OPA1NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1PCH0" edc:mask="0x1" edc:name="OPA1PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PCH1" edc:mask="0x1" edc:name="OPA1PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PCH2" edc:mask="0x1" edc:name="OPA1PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH0" edc:mask="0x1" edc:name="OPA1NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH1" edc:mask="0x1" edc:name="OPA1NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1NCH2" edc:mask="0x1" edc:name="OPA1NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn---nn" edc:cname="OPA1CON3" edc:desc="" edc:impl="0xe3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00u---uu" edc:name="OPA1CON3" edc:nzwidth="8" edc:por="000---00" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x122">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS" edc:mask="0x3" edc:name="PSS" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="INTOE" edc:mask="0x1" edc:name="INTOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS" edc:mask="0x3" edc:name="FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS0" edc:mask="0x1" edc:name="FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS1" edc:mask="0x1" edc:name="FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PSS" edc:mask="0x3" edc:name="OPA1PSS" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="OPA1INTOE" edc:mask="0x1" edc:name="OPA1INTOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS" edc:mask="0x3" edc:name="OPA1FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1PSS0" edc:mask="0x1" edc:name="OPA1PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PSS1" edc:mask="0x1" edc:name="OPA1PSS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS0" edc:mask="0x1" edc:name="OPA1FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS1" edc:mask="0x1" edc:name="OPA1FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="OPA1CON4" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---u-uuu" edc:name="OPA1CON4" edc:nzwidth="8" edc:por="---x-0xx" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x123">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFCSEL" edc:mask="0x3" edc:name="OFCSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OFCST" edc:mask="0x1" edc:name="OFCST" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PTRES" edc:mask="0x1" edc:name="PTRES" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OFCSEL0" edc:mask="0x1" edc:name="OFCSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFCSEL1" edc:mask="0x1" edc:name="OFCSEL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1OFCSEL" edc:mask="0x3" edc:name="OPA1OFCSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OPA1OFCST" edc:mask="0x1" edc:name="OPA1OFCST" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PTRES" edc:mask="0x1" edc:name="OPA1PTRES" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1OFCSEL0" edc:mask="0x1" edc:name="OPA1OFCSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFCSEL1" edc:mask="0x1" edc:name="OPA1OFCSEL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA1HWC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA1HWC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x124">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HWCL" edc:mask="0x7" edc:name="HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH" edc:mask="0x7" edc:name="HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OREN" edc:mask="0x1" edc:name="OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HWCL0" edc:mask="0x1" edc:name="HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL1" edc:mask="0x1" edc:name="HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL2" edc:mask="0x1" edc:name="HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HWCH0" edc:mask="0x1" edc:name="HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH1" edc:mask="0x1" edc:name="HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH2" edc:mask="0x1" edc:name="HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1HWCL" edc:mask="0x7" edc:name="OPA1HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1ORPOL" edc:mask="0x1" edc:name="OPA1ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH" edc:mask="0x7" edc:name="OPA1HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1OREN" edc:mask="0x1" edc:name="OPA1OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1HWCL0" edc:mask="0x1" edc:name="OPA1HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCL1" edc:mask="0x1" edc:name="OPA1HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCL2" edc:mask="0x1" edc:name="OPA1HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH0" edc:mask="0x1" edc:name="OPA1HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH1" edc:mask="0x1" edc:name="OPA1HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH2" edc:mask="0x1" edc:name="OPA1HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
