garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA1OFFSET" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA1OFFSET" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x125">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFFSET" edc:mask="0xff" edc:name="OFFSET" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OFFSET0" edc:mask="0x1" edc:name="OFFSET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET1" edc:mask="0x1" edc:name="OFFSET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET2" edc:mask="0x1" edc:name="OFFSET2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET3" edc:mask="0x1" edc:name="OFFSET3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET4" edc:mask="0x1" edc:name="OFFSET4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET5" edc:mask="0x1" edc:name="OFFSET5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET6" edc:mask="0x1" edc:name="OFFSET6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET7" edc:mask="0x1" edc:name="OFFSET7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1OFFSET" edc:mask="0xff" edc:name="OPA1OFFSET" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1OFFSET0" edc:mask="0x1" edc:name="OPA1OFFSET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET1" edc:mask="0x1" edc:name="OPA1OFFSET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET2" edc:mask="0x1" edc:name="OPA1OFFSET2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET3" edc:mask="0x1" edc:name="OPA1OFFSET3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET4" edc:mask="0x1" edc:name="OPA1OFFSET4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET5" edc:mask="0x1" edc:name="OPA1OFFSET5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET6" edc:mask="0x1" edc:name="OPA1OFFSET6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET7" edc:mask="0x1" edc:name="OPA1OFFSET7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA1ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA1ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x126">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORS0" edc:mask="0x1" edc:name="ORS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS1" edc:mask="0x1" edc:name="ORS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS2" edc:mask="0x1" edc:name="ORS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS3" edc:mask="0x1" edc:name="ORS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS4" edc:mask="0x1" edc:name="ORS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1ORS" edc:mask="0x1f" edc:name="OPA1ORS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1ORS0" edc:mask="0x1" edc:name="OPA1ORS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS1" edc:mask="0x1" edc:name="OPA1ORS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS2" edc:mask="0x1" edc:name="OPA1ORS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS3" edc:mask="0x1" edc:name="OPA1ORS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS4" edc:mask="0x1" edc:name="OPA1ORS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n-n---" edc:cname="OPA2CON0" edc:desc="" edc:impl="0xa8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0---" edc:name="OPA2CON0" edc:nzwidth="8" edc:por="0-0-0---" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x127">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="UG" edc:mask="0x1" edc:name="UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CPON" edc:mask="0x1" edc:name="CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="UG0" edc:mask="0x1" edc:name="UG0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="OPA2UG" edc:mask="0x1" edc:name="OPA2UG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2CPON" edc:mask="0x1" edc:name="OPA2CPON" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA2EN" edc:desc="" edc:mask="0x1" edc:name="OPA2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OPA2CON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OPA2CON1" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x128">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NSS" edc:mask="0x7" edc:name="NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="RESON" edc:mask="0x1" edc:name="RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL" edc:mask="0x7" edc:name="GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NSS0" edc:mask="0x1" edc:name="NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS1" edc:mask="0x1" edc:name="NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NSS2" edc:mask="0x1" edc:name="NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL0" edc:mask="0x1" edc:name="GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL1" edc:mask="0x1" edc:name="GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSEL2" edc:mask="0x1" edc:name="GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2NSS" edc:mask="0x7" edc:name="OPA2NSS" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA2RESON" edc:mask="0x1" edc:name="OPA2RESON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2GSEL" edc:mask="0x7" edc:name="OPA2GSEL" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2NSS0" edc:mask="0x1" edc:name="OPA2NSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2NSS1" edc:mask="0x1" edc:name="OPA2NSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2NSS2" edc:mask="0x1" edc:name="OPA2NSS2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2GSEL0" edc:mask="0x1" edc:name="OPA2GSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2GSEL1" edc:mask="0x1" edc:name="OPA2GSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2GSEL2" edc:mask="0x1" edc:name="OPA2GSEL2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
