garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q71.PIC
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="OPA2CON2" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="OPA2CON2" edc:nzwidth="8" edc:por="-000-000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x129">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCH" edc:mask="0x7" edc:name="PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="NCH" edc:mask="0x7" edc:name="NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PCH0" edc:mask="0x1" edc:name="PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH1" edc:mask="0x1" edc:name="PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PCH2" edc:mask="0x1" edc:name="PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH0" edc:mask="0x1" edc:name="NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH1" edc:mask="0x1" edc:name="NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NCH2" edc:mask="0x1" edc:name="NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2PCH" edc:mask="0x7" edc:name="OPA2PCH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPA2NCH" edc:mask="0x7" edc:name="OPA2NCH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2PCH0" edc:mask="0x1" edc:name="OPA2PCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PCH1" edc:mask="0x1" edc:name="OPA2PCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PCH2" edc:mask="0x1" edc:name="OPA2PCH2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2NCH0" edc:mask="0x1" edc:name="OPA2NCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2NCH1" edc:mask="0x1" edc:name="OPA2NCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2NCH2" edc:mask="0x1" edc:name="OPA2NCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA2CON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00uuuuuu" edc:name="OPA2CON3" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x12A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS" edc:mask="0x1f" edc:name="PSS" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="INTOE" edc:mask="0x1" edc:name="INTOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS" edc:mask="0x3" edc:name="FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS2" edc:mask="0x1" edc:name="PSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS3" edc:mask="0x1" edc:name="PSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS4" edc:mask="0x1" edc:name="PSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS0" edc:mask="0x1" edc:name="FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS1" edc:mask="0x1" edc:name="FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2PSS" edc:mask="0x1f" edc:name="OPA2PSS" edc:nzwidth="0x5"/>
              <edc:SFRFieldDef edc:cname="OPA2INTOE" edc:mask="0x1" edc:name="OPA2INTOE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2FMS" edc:mask="0x3" edc:name="OPA2FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2PSS0" edc:mask="0x1" edc:name="OPA2PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PSS1" edc:mask="0x1" edc:name="OPA2PSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PSS2" edc:mask="0x1" edc:name="OPA2PSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PSS3" edc:mask="0x1" edc:name="OPA2PSS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PSS4" edc:mask="0x1" edc:name="OPA2PSS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2FMS0" edc:mask="0x1" edc:name="OPA2FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2FMS1" edc:mask="0x1" edc:name="OPA2FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---n-nnn" edc:cname="OPA2CON4" edc:desc="" edc:impl="0x17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---u-uuu" edc:name="OPA2CON4" edc:nzwidth="8" edc:por="---x-0xx" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x12B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFCSEL" edc:mask="0x3" edc:name="OFCSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OFCST" edc:mask="0x1" edc:name="OFCST" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="PTRES" edc:mask="0x1" edc:name="PTRES" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OFCSEL0" edc:mask="0x1" edc:name="OFCSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFCSEL1" edc:mask="0x1" edc:name="OFCSEL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2OFCSEL" edc:mask="0x3" edc:name="OPA2OFCSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="OPA2OFCST" edc:mask="0x1" edc:name="OPA2OFCST" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2PTRES" edc:mask="0x1" edc:name="OPA2PTRES" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2OFCSEL0" edc:mask="0x1" edc:name="OPA2OFCSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFCSEL1" edc:mask="0x1" edc:name="OPA2OFCSEL1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA2HWC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA2HWC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x12C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HWCL" edc:mask="0x7" edc:name="HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH" edc:mask="0x7" edc:name="HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OREN" edc:mask="0x1" edc:name="OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HWCL0" edc:mask="0x1" edc:name="HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL1" edc:mask="0x1" edc:name="HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL2" edc:mask="0x1" edc:name="HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HWCH0" edc:mask="0x1" edc:name="HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH1" edc:mask="0x1" edc:name="HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH2" edc:mask="0x1" edc:name="HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2HWCL" edc:mask="0x7" edc:name="OPA2HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA2ORPOL" edc:mask="0x1" edc:name="OPA2ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2HWCH" edc:mask="0x7" edc:name="OPA2HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA2OREN" edc:mask="0x1" edc:name="OPA2OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2HWCL0" edc:mask="0x1" edc:name="OPA2HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2HWCL1" edc:mask="0x1" edc:name="OPA2HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2HWCL2" edc:mask="0x1" edc:name="OPA2HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2HWCH0" edc:mask="0x1" edc:name="OPA2HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2HWCH1" edc:mask="0x1" edc:name="OPA2HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2HWCH2" edc:mask="0x1" edc:name="OPA2HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
