garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T4HLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T4HLT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x32D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1f" edc:name="MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE4" edc:mask="0x1" edc:name="MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4MODE" edc:desc="" edc:mask="0x1f" edc:name="T4MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="T4CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T4CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4CKPOL" edc:desc="" edc:mask="0x1" edc:name="T4CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4PSYNC" edc:desc="" edc:mask="0x1" edc:name="T4PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4MODE0" edc:desc="" edc:mask="0x1" edc:name="T4MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4MODE1" edc:desc="" edc:mask="0x1" edc:name="T4MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4MODE2" edc:desc="" edc:mask="0x1" edc:name="T4MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4MODE3" edc:desc="" edc:mask="0x1" edc:name="T4MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4MODE4" edc:mask="0x1" edc:name="T4MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T4CLKCON" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="T4CLKCON" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x32E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T4CLK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0x1f" edc:name="CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4CS" edc:mask="0x1f" edc:name="T4CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4CS0" edc:mask="0x1" edc:name="T4CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4CS1" edc:mask="0x1" edc:name="T4CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4CS2" edc:mask="0x1" edc:name="T4CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4CS3" edc:mask="0x1" edc:name="T4CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4CS4" edc:mask="0x1" edc:name="T4CS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T4RST" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="T4RST" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x32F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:mask="0x1f" edc:name="RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:mask="0x1" edc:name="RSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T4RSEL" edc:mask="0x1f" edc:name="T4RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T4RSEL0" edc:mask="0x1" edc:name="T4RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL1" edc:mask="0x1" edc:name="T4RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL2" edc:mask="0x1" edc:name="T4RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL3" edc:mask="0x1" edc:name="T4RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T4RSEL4" edc:mask="0x1" edc:name="T4RSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x10" edc:_addr="0x330"/>
        <edc:JoinedSFRDef edc:cname="CCPR1" edc:desc="" edc:name="CCPR1" edc:nzwidth="0x10" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x340">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR1L" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR1L" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x340">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RL" edc:desc="" edc:mask="0xff" edc:name="RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
