garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F25Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPS" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPS" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3AD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:mask="0xff" edc:name="PS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:mask="0x1" edc:name="PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:mask="0x1" edc:name="PS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:mask="0x1" edc:name="PS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS3" edc:mask="0x1" edc:name="PS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS4" edc:mask="0x1" edc:name="PS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS5" edc:mask="0x1" edc:name="PS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS6" edc:mask="0x1" edc:name="PS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS7" edc:mask="0x1" edc:name="PS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TU16BPS0" edc:mask="0x1" edc:name="TU16BPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS1" edc:mask="0x1" edc:name="TU16BPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS2" edc:mask="0x1" edc:name="TU16BPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS3" edc:mask="0x1" edc:name="TU16BPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS4" edc:mask="0x1" edc:name="TU16BPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS5" edc:mask="0x1" edc:name="TU16BPS5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS6" edc:mask="0x1" edc:name="TU16BPS6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BPS7" edc:mask="0x1" edc:name="TU16BPS7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="TU16BPS" edc:mask="0xff" edc:name="TU16BPS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TU16BTMR" edc:desc="" edc:name="TU16BTMR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3AE">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TU16BCR"/>
          </edc:AliasList>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x3AE">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3AE">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xff" edc:name="TMRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRL0" edc:mask="0x1" edc:name="TMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL1" edc:mask="0x1" edc:name="TMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL2" edc:mask="0x1" edc:name="TMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL3" edc:mask="0x1" edc:name="TMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL4" edc:mask="0x1" edc:name="TMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL5" edc:mask="0x1" edc:name="TMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL6" edc:mask="0x1" edc:name="TMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRL7" edc:mask="0x1" edc:name="TMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRL0" edc:mask="0x1" edc:name="TU16BTMRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL1" edc:mask="0x1" edc:name="TU16BTMRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL2" edc:mask="0x1" edc:name="TU16BTMRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL3" edc:mask="0x1" edc:name="TU16BTMRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL4" edc:mask="0x1" edc:name="TU16BTMRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL5" edc:mask="0x1" edc:name="TU16BTMRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL6" edc:mask="0x1" edc:name="TU16BTMRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRL7" edc:mask="0x1" edc:name="TU16BTMRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR0" edc:mask="0x1" edc:name="TU16BTMR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR1" edc:mask="0x1" edc:name="TU16BTMR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR2" edc:mask="0x1" edc:name="TU16BTMR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR3" edc:mask="0x1" edc:name="TU16BTMR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR4" edc:mask="0x1" edc:name="TU16BTMR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR5" edc:mask="0x1" edc:name="TU16BTMR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR6" edc:mask="0x1" edc:name="TU16BTMR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR7" edc:mask="0x1" edc:name="TU16BTMR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRL" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3AE">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRL" edc:desc="" edc:mask="0xff" edc:name="CRL" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRL0" edc:mask="0x1" edc:name="CRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL1" edc:mask="0x1" edc:name="CRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL2" edc:mask="0x1" edc:name="CRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL3" edc:mask="0x1" edc:name="CRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL4" edc:mask="0x1" edc:name="CRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL5" edc:mask="0x1" edc:name="CRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL6" edc:mask="0x1" edc:name="CRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRL7" edc:mask="0x1" edc:name="CRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRL0" edc:mask="0x1" edc:name="TU16BCRL0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL1" edc:mask="0x1" edc:name="TU16BCRL1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL2" edc:mask="0x1" edc:name="TU16BCRL2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL3" edc:mask="0x1" edc:name="TU16BCRL3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL4" edc:mask="0x1" edc:name="TU16BCRL4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL5" edc:mask="0x1" edc:name="TU16BCRL5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL6" edc:mask="0x1" edc:name="TU16BCRL6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRL7" edc:mask="0x1" edc:name="TU16BCRL7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR0" edc:mask="0x1" edc:name="TU16BCR0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR1" edc:mask="0x1" edc:name="TU16BCR1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR2" edc:mask="0x1" edc:name="TU16BCR2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR3" edc:mask="0x1" edc:name="TU16BCR3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR4" edc:mask="0x1" edc:name="TU16BCR4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR5" edc:mask="0x1" edc:name="TU16BCR5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR6" edc:mask="0x1" edc:name="TU16BCR6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR7" edc:mask="0x1" edc:name="TU16BCR7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
          <edc:MuxedSFRDef edc:nzwidth="0x8" edc:_addr="0x3AF">
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x1">
              <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BTMRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BTMRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3AF">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xff" edc:name="TMRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="TMRH0" edc:mask="0x1" edc:name="TMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH1" edc:mask="0x1" edc:name="TMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH2" edc:mask="0x1" edc:name="TMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH3" edc:mask="0x1" edc:name="TMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH4" edc:mask="0x1" edc:name="TMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH5" edc:mask="0x1" edc:name="TMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH6" edc:mask="0x1" edc:name="TMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TMRH7" edc:mask="0x1" edc:name="TMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BTMRH0" edc:mask="0x1" edc:name="TU16BTMRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH1" edc:mask="0x1" edc:name="TU16BTMRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH2" edc:mask="0x1" edc:name="TU16BTMRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH3" edc:mask="0x1" edc:name="TU16BTMRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH4" edc:mask="0x1" edc:name="TU16BTMRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH5" edc:mask="0x1" edc:name="TU16BTMRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH6" edc:mask="0x1" edc:name="TU16BTMRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMRH7" edc:mask="0x1" edc:name="TU16BTMRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BTMR8" edc:mask="0x1" edc:name="TU16BTMR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR9" edc:mask="0x1" edc:name="TU16BTMR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR10" edc:mask="0x1" edc:name="TU16BTMR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR11" edc:mask="0x1" edc:name="TU16BTMR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR12" edc:mask="0x1" edc:name="TU16BTMR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR13" edc:mask="0x1" edc:name="TU16BTMR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR14" edc:mask="0x1" edc:name="TU16BTMR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BTMR15" edc:mask="0x1" edc:name="TU16BTMR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
            <edc:SelectSFR edc:when="($0x0 &amp; 0x08) == 0x0">
              <edc:SFRDef edc:access="rrrrrrrr" edc:cname="TU16BCRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BCRH" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x3AF">
                <edc:AliasList/>
                <edc:SFRModeList>
                  <edc:SFRMode edc:id="DS.0">
                    <edc:SFRFieldDef edc:cname="CRH" edc:desc="" edc:mask="0xff" edc:name="CRH" edc:nzwidth="8"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.0">
                    <edc:SFRFieldDef edc:cname="CRH0" edc:mask="0x1" edc:name="CRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH1" edc:mask="0x1" edc:name="CRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH2" edc:mask="0x1" edc:name="CRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH3" edc:mask="0x1" edc:name="CRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH4" edc:mask="0x1" edc:name="CRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH5" edc:mask="0x1" edc:name="CRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH6" edc:mask="0x1" edc:name="CRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="CRH7" edc:mask="0x1" edc:name="CRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.1">
                    <edc:SFRFieldDef edc:cname="TU16BCRH0" edc:mask="0x1" edc:name="TU16BCRH0" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH1" edc:mask="0x1" edc:name="TU16BCRH1" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH2" edc:mask="0x1" edc:name="TU16BCRH2" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH3" edc:mask="0x1" edc:name="TU16BCRH3" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH4" edc:mask="0x1" edc:name="TU16BCRH4" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH5" edc:mask="0x1" edc:name="TU16BCRH5" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH6" edc:mask="0x1" edc:name="TU16BCRH6" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCRH7" edc:mask="0x1" edc:name="TU16BCRH7" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                  <edc:SFRMode edc:id="LT.2">
                    <edc:SFRFieldDef edc:cname="TU16BCR8" edc:mask="0x1" edc:name="TU16BCR8" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR9" edc:mask="0x1" edc:name="TU16BCR9" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR10" edc:mask="0x1" edc:name="TU16BCR10" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR11" edc:mask="0x1" edc:name="TU16BCR11" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR12" edc:mask="0x1" edc:name="TU16BCR12" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR13" edc:mask="0x1" edc:name="TU16BCR13" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR14" edc:mask="0x1" edc:name="TU16BCR14" edc:nzwidth="0x1"/>
                    <edc:SFRFieldDef edc:cname="TU16BCR15" edc:mask="0x1" edc:name="TU16BCR15" edc:nzwidth="0x1"/>
                  </edc:SFRMode>
                </edc:SFRModeList>
              </edc:SFRDef>
            </edc:SelectSFR>
          </edc:MuxedSFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="TU16BPR" edc:desc="" edc:name="TU16BPR" edc:nzwidth="0x10" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3B0">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TU16BPRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TU16BPRL" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-03877_tmr_8bit_v1_16bits.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x3B0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRL" edc:mask="0xff" edc:name="PRL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRL0" edc:mask="0x1" edc:name="PRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL1" edc:mask="0x1" edc:name="PRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL2" edc:mask="0x1" edc:name="PRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL3" edc:mask="0x1" edc:name="PRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL4" edc:mask="0x1" edc:name="PRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL5" edc:mask="0x1" edc:name="PRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL6" edc:mask="0x1" edc:name="PRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRL7" edc:mask="0x1" edc:name="PRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="TU16BPRL0" edc:mask="0x1" edc:name="TU16BPRL0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL1" edc:mask="0x1" edc:name="TU16BPRL1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL2" edc:mask="0x1" edc:name="TU16BPRL2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL3" edc:mask="0x1" edc:name="TU16BPRL3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL4" edc:mask="0x1" edc:name="TU16BPRL4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL5" edc:mask="0x1" edc:name="TU16BPRL5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL6" edc:mask="0x1" edc:name="TU16BPRL6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPRL7" edc:mask="0x1" edc:name="TU16BPRL7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="TU16BPR0" edc:mask="0x1" edc:name="TU16BPR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR1" edc:mask="0x1" edc:name="TU16BPR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR2" edc:mask="0x1" edc:name="TU16BPR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR3" edc:mask="0x1" edc:name="TU16BPR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR4" edc:mask="0x1" edc:name="TU16BPR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR5" edc:mask="0x1" edc:name="TU16BPR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR6" edc:mask="0x1" edc:name="TU16BPR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="TU16BPR7" edc:mask="0x1" edc:name="TU16BPR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
